{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|pad|>": 1,
      ".": 2,
      "2": 3,
      "4": 4,
      "A": 5,
      "B": 6,
      "C": 7,
      "D": 8,
      "E": 9,
      "F": 10,
      "G": 11,
      "H": 12,
      "I": 13,
      "J": 14,
      "K": 15,
      "L": 16,
      "M": 17,
      "N": 18,
      "O": 19,
      "P": 20,
      "Q": 21,
      "R": 22,
      "S": 23,
      "T": 24,
      "U": 25,
      "V": 26,
      "W": 27,
      "X": 28,
      "Y": 29,
      "Z": 30,
      "a": 31,
      "b": 32,
      "c": 33,
      "d": 34,
      "e": 35,
      "f": 36,
      "g": 37,
      "h": 38,
      "i": 39,
      "j": 40,
      "k": 41,
      "l": 42,
      "m": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "q": 47,
      "r": 48,
      "s": 49,
      "t": 50,
      "u": 51,
      "v": 52,
      "w": 53,
      "x": 54,
      "y": 55,
      "z": 56,
      "Ġ": 57,
      "he": 58,
      "is": 59,
      "Ġt": 60,
      "Ġo": 61,
      "ĠT": 62,
      "Ġis": 63,
      "Ġof": 64,
      "ĠThe": 65,
      "an": 66,
      "er": 67,
      "ĠF": 68,
      "ĠP": 69,
      "Ġl": 70,
      "Ġthe": 71,
      "ĠH": 72,
      "42": 73,
      "al": 74,
      "ap": 75,
      "ar": 76,
      "az": 77,
      "br": 78,
      "ce": 79,
      "ck": 80,
      "cap": 81,
      "do": 82,
      "el": 83,
      "en": 84,
      "es": 85,
      "ean": 86,
      "fe": 87,
      "fo": 88,
      "his": 89,
      "in": 90,
      "it": 91,
      "iz": 92,
      "ick": 93,
      "ife": 94,
      "ju": 95,
      "ken": 96,
      "ld": 97,
      "lo": 98,
      "mp": 99,
      "mean": 100,
      "or": 101,
      "ow": 102,
      "oken": 103,
      "qu": 104,
      "ran": 105,
      "ver": 106,
      "wor": 107,
      "ĠB": 108,
      "ĠC": 109,
      "ĠD": 110,
      "ĠE": 111,
      "ĠG": 112,
      "ĠI": 113,
      "ĠJ": 114,
      "ĠK": 115,
      "ĠL": 116,
      "ĠM": 117,
      "ĠN": 118,
      "ĠO": 119,
      "ĠQ": 120,
      "ĠR": 121,
      "ĠS": 122,
      "ĠU": 123,
      "ĠV": 124,
      "ĠW": 125,
      "ĠX": 126,
      "ĠY": 127,
      "ĠZ": 128,
      "Ġa": 129,
      "Ġ42": 130,
      "Ġbr": 131,
      "Ġcap": 132,
      "Ġdo": 133,
      "Ġfo": 134,
      "Ġju": 135,
      "Ġmean": 136,
      "Ġqu": 137,
      "Ġwor": 138,
      "Ġtes": 139,
      "Ġthis": 140,
      "Ġtoken": 141,
      "Ġover": 142,
      "ĠFran": 143,
      "ĠPar": 144,
      "Ġlaz": 145,
      "Ġlife": 146,
      "ello": 147,
      "ing": 148,
      "ital": 149,
      "izer": 150,
      "mps": 151,
      "own": 152,
      "Ġbrown": 153,
      "Ġcapital": 154,
      "Ġdog": 155,
      "Ġfox": 156,
      "Ġjumps": 157,
      "Ġmeaning": 158,
      "Ġquick": 159,
      "Ġworld": 160,
      "Ġtest": 161,
      "Ġtokenizer": 162,
      "ĠFrance": 163,
      "ĠParis": 164,
      "Ġlazy": 165,
      "ĠA": 166,
      "ĠHello": 167,
      "The": 168,
      "Hello": 169
    },
    "merges": [
      [
        "h",
        "e"
      ],
      [
        "i",
        "s"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "ĠT",
        "he"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "r"
      ],
      [
        "Ġ",
        "F"
      ],
      [
        "Ġ",
        "P"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġ",
        "H"
      ],
      [
        "4",
        "2"
      ],
      [
        "a",
        "l"
      ],
      [
        "a",
        "p"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "z"
      ],
      [
        "b",
        "r"
      ],
      [
        "c",
        "e"
      ],
      [
        "c",
        "k"
      ],
      [
        "c",
        "ap"
      ],
      [
        "d",
        "o"
      ],
      [
        "e",
        "l"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "an"
      ],
      [
        "f",
        "e"
      ],
      [
        "f",
        "o"
      ],
      [
        "h",
        "is"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "z"
      ],
      [
        "i",
        "ck"
      ],
      [
        "i",
        "fe"
      ],
      [
        "j",
        "u"
      ],
      [
        "k",
        "en"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "o"
      ],
      [
        "m",
        "p"
      ],
      [
        "m",
        "ean"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "w"
      ],
      [
        "o",
        "ken"
      ],
      [
        "q",
        "u"
      ],
      [
        "r",
        "an"
      ],
      [
        "v",
        "er"
      ],
      [
        "w",
        "or"
      ],
      [
        "Ġ",
        "B"
      ],
      [
        "Ġ",
        "C"
      ],
      [
        "Ġ",
        "D"
      ],
      [
        "Ġ",
        "E"
      ],
      [
        "Ġ",
        "G"
      ],
      [
        "Ġ",
        "I"
      ],
      [
        "Ġ",
        "J"
      ],
      [
        "Ġ",
        "K"
      ],
      [
        "Ġ",
        "L"
      ],
      [
        "Ġ",
        "M"
      ],
      [
        "Ġ",
        "N"
      ],
      [
        "Ġ",
        "O"
      ],
      [
        "Ġ",
        "Q"
      ],
      [
        "Ġ",
        "R"
      ],
      [
        "Ġ",
        "S"
      ],
      [
        "Ġ",
        "U"
      ],
      [
        "Ġ",
        "V"
      ],
      [
        "Ġ",
        "W"
      ],
      [
        "Ġ",
        "X"
      ],
      [
        "Ġ",
        "Y"
      ],
      [
        "Ġ",
        "Z"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "42"
      ],
      [
        "Ġ",
        "br"
      ],
      [
        "Ġ",
        "cap"
      ],
      [
        "Ġ",
        "do"
      ],
      [
        "Ġ",
        "fo"
      ],
      [
        "Ġ",
        "ju"
      ],
      [
        "Ġ",
        "mean"
      ],
      [
        "Ġ",
        "qu"
      ],
      [
        "Ġ",
        "wor"
      ],
      [
        "Ġt",
        "es"
      ],
      [
        "Ġt",
        "his"
      ],
      [
        "Ġt",
        "oken"
      ],
      [
        "Ġo",
        "ver"
      ],
      [
        "ĠF",
        "ran"
      ],
      [
        "ĠP",
        "ar"
      ],
      [
        "Ġl",
        "az"
      ],
      [
        "Ġl",
        "ife"
      ],
      [
        "el",
        "lo"
      ],
      [
        "in",
        "g"
      ],
      [
        "it",
        "al"
      ],
      [
        "iz",
        "er"
      ],
      [
        "mp",
        "s"
      ],
      [
        "ow",
        "n"
      ],
      [
        "Ġbr",
        "own"
      ],
      [
        "Ġcap",
        "ital"
      ],
      [
        "Ġdo",
        "g"
      ],
      [
        "Ġfo",
        "x"
      ],
      [
        "Ġju",
        "mps"
      ],
      [
        "Ġmean",
        "ing"
      ],
      [
        "Ġqu",
        "ick"
      ],
      [
        "Ġwor",
        "ld"
      ],
      [
        "Ġtes",
        "t"
      ],
      [
        "Ġtoken",
        "izer"
      ],
      [
        "ĠFran",
        "ce"
      ],
      [
        "ĠPar",
        "is"
      ],
      [
        "Ġlaz",
        "y"
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "ĠH",
        "ello"
      ],
      [
        "T",
        "he"
      ],
      [
        "H",
        "ello"
      ]
    ]
  }
}