{"\u0000": 0, "\u0001": 1, "\u0002": 2, "\u0003": 3, "\u0004": 4, "\u0005": 5, "\u0006": 6, "\u0007": 7, "\b": 8, "\t": 9, "\n": 10, "\u000b": 11, "\f": 12, "\r": 13, "\u000e": 14, "\u000f": 15, "\u0010": 16, "\u0011": 17, "\u0012": 18, "\u0013": 19, "\u0014": 20, "\u0015": 21, "\u0016": 22, "\u0017": 23, "\u0018": 24, "\u0019": 25, "\u001a": 26, "\u001b": 27, "\u001c": 28, "\u001d": 29, "\u001e": 30, "\u001f": 31, " ": 32, "!": 33, "\"": 34, "#": 35, "$": 36, "%": 37, "&": 38, "'": 39, "(": 40, ")": 41, "*": 42, "+": 43, ",": 44, "-": 45, ".": 46, "/": 47, "0": 48, "1": 49, "2": 50, "3": 51, "4": 52, "5": 53, "6": 54, "7": 55, "8": 56, "9": 57, ":": 58, ";": 59, "<": 60, "=": 61, ">": 62, "?": 63, "@": 64, "A": 65, "B": 66, "C": 67, "D": 68, "E": 69, "F": 70, "G": 71, "H": 72, "I": 73, "J": 74, "K": 75, "L": 76, "M": 77, "N": 78, "O": 79, "P": 80, "Q": 81, "R": 82, "S": 83, "T": 84, "U": 85, "V": 86, "W": 87, "X": 88, "Y": 89, "Z": 90, "[": 91, "\\": 92, "]": 93, "^": 94, "_": 95, "`": 96, "a": 97, "b": 98, "c": 99, "d": 100, "e": 101, "f": 102, "g": 103, "h": 104, "i": 105, "j": 106, "k": 107, "l": 108, "m": 109, "n": 110, "o": 111, "p": 112, "q": 113, "r": 114, "s": 115, "t": 116, "u": 117, "v": 118, "w": 119, "x": 120, "y": 121, "z": 122, "{": 123, "|": 124, "}": 125, "~": 126, "\u007f": 127, "\u0080": 128, "\u0081": 129, "\u0082": 130, "\u0083": 131, "\u0084": 132, "\u0085": 133, "\u0086": 134, "\u0087": 135, "\u0088": 136, "\u0089": 137, "\u008a": 138, "\u008b": 139, "\u008c": 140, "\u008d": 141, "\u008e": 142, "\u008f": 143, "\u0090": 144, "\u0091": 145, "\u0092": 146, "\u0093": 147, "\u0094": 148, "\u0095": 149, "\u0096": 150, "\u0097": 151, "\u0098": 152, "\u0099": 153, "\u009a": 154, "\u009b": 155, "\u009c": 156, "\u009d": 157, "\u009e": 158, "\u009f": 159, "\u00a0": 160, "\u00a1": 161, "\u00a2": 162, "\u00a3": 163, "\u00a4": 164, "\u00a5": 165, "\u00a6": 166, "\u00a7": 167, "\u00a8": 168, "\u00a9": 169, "\u00aa": 170, "\u00ab": 171, "\u00ac": 172, "\u00ad": 173, "\u00ae": 174, "\u00af": 175, "\u00b0": 176, "\u00b1": 177, "\u00b2": 178, "\u00b3": 179, "\u00b4": 180, "\u00b5": 181, "\u00b6": 182, "\u00b7": 183, "\u00b8": 184, "\u00b9": 185, "\u00ba": 186, "\u00bb": 187, "\u00bc": 188, "\u00bd": 189, "\u00be": 190, "\u00bf": 191, "\u00c0": 192, "\u00c1": 193, "\u00c2": 194, "\u00c3": 195, "\u00c4": 196, "\u00c5": 197, "\u00c6": 198, "\u00c7": 199, "\u00c8": 200, "\u00c9": 201, "\u00ca": 202, "\u00cb": 203, "\u00cc": 204, "\u00cd": 205, "\u00ce": 206, "\u00cf": 207, "\u00d0": 208, "\u00d1": 209, "\u00d2": 210, "\u00d3": 211, "\u00d4": 212, "\u00d5": 213, "\u00d6": 214, "\u00d7": 215, "\u00d8": 216, "\u00d9": 217, "\u00da": 218, "\u00db": 219, "\u00dc": 220, "\u00dd": 221, "\u00de": 222, "\u00df": 223, "\u00e0": 224, "\u00e1": 225, "\u00e2": 226, "\u00e3": 227, "\u00e4": 228, "\u00e5": 229, "\u00e6": 230, "\u00e7": 231, "\u00e8": 232, "\u00e9": 233, "\u00ea": 234, "\u00eb": 235, "\u00ec": 236, "\u00ed": 237, "\u00ee": 238, "\u00ef": 239, "\u00f0": 240, "\u00f1": 241, "\u00f2": 242, "\u00f3": 243, "\u00f4": 244, "\u00f5": 245, "\u00f6": 246, "\u00f7": 247, "\u00f8": 248, "\u00f9": 249, "\u00fa": 250, "\u00fb": 251, "\u00fc": 252, "\u00fd": 253, "\u00fe": 254, "\u00ff": 255, "token_0": 256, "token_1": 257, "token_2": 258, "token_3": 259, "token_4": 260, "token_5": 261, "token_6": 262, "token_7": 263, "token_8": 264, "token_9": 265, "token_10": 266, "token_11": 267, "token_12": 268, "token_13": 269, "token_14": 270, "token_15": 271, "token_16": 272, "token_17": 273, "token_18": 274, "token_19": 275, "token_20": 276, "token_21": 277, "token_22": 278, "token_23": 279, "token_24": 280, "token_25": 281, "token_26": 282, "token_27": 283, "token_28": 284, "token_29": 285, "token_30": 286, "token_31": 287, "token_32": 288, "token_33": 289, "token_34": 290, "token_35": 291, "token_36": 292, "token_37": 293, "token_38": 294, "token_39": 295, "token_40": 296, "token_41": 297, "token_42": 298, "token_43": 299, "token_44": 300, "token_45": 301, "token_46": 302, "token_47": 303, "token_48": 304, "token_49": 305, "token_50": 306, "token_51": 307, "token_52": 308, "token_53": 309, "token_54": 310, "token_55": 311, "token_56": 312, "token_57": 313, "token_58": 314, "token_59": 315, "token_60": 316, "token_61": 317, "token_62": 318, "token_63": 319, "token_64": 320, "token_65": 321, "token_66": 322, "token_67": 323, "token_68": 324, "token_69": 325, "token_70": 326, "token_71": 327, "token_72": 328, "token_73": 329, "token_74": 330, "token_75": 331, "token_76": 332, "token_77": 333, "token_78": 334, "token_79": 335, "token_80": 336, "token_81": 337, "token_82": 338, "token_83": 339, "token_84": 340, "token_85": 341, "token_86": 342, "token_87": 343, "token_88": 344, "token_89": 345, "token_90": 346, "token_91": 347, "token_92": 348, "token_93": 349, "token_94": 350, "token_95": 351, "token_96": 352, "token_97": 353, "token_98": 354, "token_99": 355, "token_100": 356, "token_101": 357, "token_102": 358, "token_103": 359, "token_104": 360, "token_105": 361, "token_106": 362, "token_107": 363, "token_108": 364, "token_109": 365, "token_110": 366, "token_111": 367, "token_112": 368, "token_113": 369, "token_114": 370, "token_115": 371, "token_116": 372, "token_117": 373, "token_118": 374, "token_119": 375, "token_120": 376, "token_121": 377, "token_122": 378, "token_123": 379, "token_124": 380, "token_125": 381, "token_126": 382, "token_127": 383, "token_128": 384, "token_129": 385, "token_130": 386, "token_131": 387, "token_132": 388, "token_133": 389, "token_134": 390, "token_135": 391, "token_136": 392, "token_137": 393, "token_138": 394, "token_139": 395, "token_140": 396, "token_141": 397, "token_142": 398, "token_143": 399, "token_144": 400, "token_145": 401, "token_146": 402, "token_147": 403, "token_148": 404, "token_149": 405, "token_150": 406, "token_151": 407, "token_152": 408, "token_153": 409, "token_154": 410, "token_155": 411, "token_156": 412, "token_157": 413, "token_158": 414, "token_159": 415, "token_160": 416, "token_161": 417, "token_162": 418, "token_163": 419, "token_164": 420, "token_165": 421, "token_166": 422, "token_167": 423, "token_168": 424, "token_169": 425, "token_170": 426, "token_171": 427, "token_172": 428, "token_173": 429, "token_174": 430, "token_175": 431, "token_176": 432, "token_177": 433, "token_178": 434, "token_179": 435, "token_180": 436, "token_181": 437, "token_182": 438, "token_183": 439, "token_184": 440, "token_185": 441, "token_186": 442, "token_187": 443, "token_188": 444, "token_189": 445, "token_190": 446, "token_191": 447, "token_192": 448, "token_193": 449, "token_194": 450, "token_195": 451, "token_196": 452, "token_197": 453, "token_198": 454, "token_199": 455, "token_200": 456, "token_201": 457, "token_202": 458, "token_203": 459, "token_204": 460, "token_205": 461, "token_206": 462, "token_207": 463, "token_208": 464, "token_209": 465, "token_210": 466, "token_211": 467, "token_212": 468, "token_213": 469, "token_214": 470, "token_215": 471, "token_216": 472, "token_217": 473, "token_218": 474, "token_219": 475, "token_220": 476, "token_221": 477, "token_222": 478, "token_223": 479, "token_224": 480, "token_225": 481, "token_226": 482, "token_227": 483, "token_228": 484, "token_229": 485, "token_230": 486, "token_231": 487, "token_232": 488, "token_233": 489, "token_234": 490, "token_235": 491, "token_236": 492, "token_237": 493, "token_238": 494, "token_239": 495, "token_240": 496, "token_241": 497, "token_242": 498, "token_243": 499, "token_244": 500, "token_245": 501, "token_246": 502, "token_247": 503, "token_248": 504, "token_249": 505, "token_250": 506, "token_251": 507, "token_252": 508, "token_253": 509, "token_254": 510, "token_255": 511, "token_256": 512, "token_257": 513, "token_258": 514, "token_259": 515, "token_260": 516, "token_261": 517, "token_262": 518, "token_263": 519, "token_264": 520, "token_265": 521, "token_266": 522, "token_267": 523, "token_268": 524, "token_269": 525, "token_270": 526, "token_271": 527, "token_272": 528, "token_273": 529, "token_274": 530, "token_275": 531, "token_276": 532, "token_277": 533, "token_278": 534, "token_279": 535, "token_280": 536, "token_281": 537, "token_282": 538, "token_283": 539, "token_284": 540, "token_285": 541, "token_286": 542, "token_287": 543, "token_288": 544, "token_289": 545, "token_290": 546, "token_291": 547, "token_292": 548, "token_293": 549, "token_294": 550, "token_295": 551, "token_296": 552, "token_297": 553, "token_298": 554, "token_299": 555, "token_300": 556, "token_301": 557, "token_302": 558, "token_303": 559, "token_304": 560, "token_305": 561, "token_306": 562, "token_307": 563, "token_308": 564, "token_309": 565, "token_310": 566, "token_311": 567, "token_312": 568, "token_313": 569, "token_314": 570, "token_315": 571, "token_316": 572, "token_317": 573, "token_318": 574, "token_319": 575, "token_320": 576, "token_321": 577, "token_322": 578, "token_323": 579, "token_324": 580, "token_325": 581, "token_326": 582, "token_327": 583, "token_328": 584, "token_329": 585, "token_330": 586, "token_331": 587, "token_332": 588, "token_333": 589, "token_334": 590, "token_335": 591, "token_336": 592, "token_337": 593, "token_338": 594, "token_339": 595, "token_340": 596, "token_341": 597, "token_342": 598, "token_343": 599, "token_344": 600, "token_345": 601, "token_346": 602, "token_347": 603, "token_348": 604, "token_349": 605, "token_350": 606, "token_351": 607, "token_352": 608, "token_353": 609, "token_354": 610, "token_355": 611, "token_356": 612, "token_357": 613, "token_358": 614, "token_359": 615, "token_360": 616, "token_361": 617, "token_362": 618, "token_363": 619, "token_364": 620, "token_365": 621, "token_366": 622, "token_367": 623, "token_368": 624, "token_369": 625, "token_370": 626, "token_371": 627, "token_372": 628, "token_373": 629, "token_374": 630, "token_375": 631, "token_376": 632, "token_377": 633, "token_378": 634, "token_379": 635, "token_380": 636, "token_381": 637, "token_382": 638, "token_383": 639, "token_384": 640, "token_385": 641, "token_386": 642, "token_387": 643, "token_388": 644, "token_389": 645, "token_390": 646, "token_391": 647, "token_392": 648, "token_393": 649, "token_394": 650, "token_395": 651, "token_396": 652, "token_397": 653, "token_398": 654, "token_399": 655, "token_400": 656, "token_401": 657, "token_402": 658, "token_403": 659, "token_404": 660, "token_405": 661, "token_406": 662, "token_407": 663, "token_408": 664, "token_409": 665, "token_410": 666, "token_411": 667, "token_412": 668, "token_413": 669, "token_414": 670, "token_415": 671, "token_416": 672, "token_417": 673, "token_418": 674, "token_419": 675, "token_420": 676, "token_421": 677, "token_422": 678, "token_423": 679, "token_424": 680, "token_425": 681, "token_426": 682, "token_427": 683, "token_428": 684, "token_429": 685, "token_430": 686, "token_431": 687, "token_432": 688, "token_433": 689, "token_434": 690, "token_435": 691, "token_436": 692, "token_437": 693, "token_438": 694, "token_439": 695, "token_440": 696, "token_441": 697, "token_442": 698, "token_443": 699, "token_444": 700, "token_445": 701, "token_446": 702, "token_447": 703, "token_448": 704, "token_449": 705, "token_450": 706, "token_451": 707, "token_452": 708, "token_453": 709, "token_454": 710, "token_455": 711, "token_456": 712, "token_457": 713, "token_458": 714, "token_459": 715, "token_460": 716, "token_461": 717, "token_462": 718, "token_463": 719, "token_464": 720, "token_465": 721, "token_466": 722, "token_467": 723, "token_468": 724, "token_469": 725, "token_470": 726, "token_471": 727, "token_472": 728, "token_473": 729, "token_474": 730, "token_475": 731, "token_476": 732, "token_477": 733, "token_478": 734, "token_479": 735, "token_480": 736, "token_481": 737, "token_482": 738, "token_483": 739, "token_484": 740, "token_485": 741, "token_486": 742, "token_487": 743, "token_488": 744, "token_489": 745, "token_490": 746, "token_491": 747, "token_492": 748, "token_493": 749, "token_494": 750, "token_495": 751, "token_496": 752, "token_497": 753, "token_498": 754, "token_499": 755, "token_500": 756, "token_501": 757, "token_502": 758, "token_503": 759, "token_504": 760, "token_505": 761, "token_506": 762, "token_507": 763, "token_508": 764, "token_509": 765, "token_510": 766, "token_511": 767, "token_512": 768, "token_513": 769, "token_514": 770, "token_515": 771, "token_516": 772, "token_517": 773, "token_518": 774, "token_519": 775, "token_520": 776, "token_521": 777, "token_522": 778, "token_523": 779, "token_524": 780, "token_525": 781, "token_526": 782, "token_527": 783, "token_528": 784, "token_529": 785, "token_530": 786, "token_531": 787, "token_532": 788, "token_533": 789, "token_534": 790, "token_535": 791, "token_536": 792, "token_537": 793, "token_538": 794, "token_539": 795, "token_540": 796, "token_541": 797, "token_542": 798, "token_543": 799, "token_544": 800, "token_545": 801, "token_546": 802, "token_547": 803, "token_548": 804, "token_549": 805, "token_550": 806, "token_551": 807, "token_552": 808, "token_553": 809, "token_554": 810, "token_555": 811, "token_556": 812, "token_557": 813, "token_558": 814, "token_559": 815, "token_560": 816, "token_561": 817, "token_562": 818, "token_563": 819, "token_564": 820, "token_565": 821, "token_566": 822, "token_567": 823, "token_568": 824, "token_569": 825, "token_570": 826, "token_571": 827, "token_572": 828, "token_573": 829, "token_574": 830, "token_575": 831, "token_576": 832, "token_577": 833, "token_578": 834, "token_579": 835, "token_580": 836, "token_581": 837, "token_582": 838, "token_583": 839, "token_584": 840, "token_585": 841, "token_586": 842, "token_587": 843, "token_588": 844, "token_589": 845, "token_590": 846, "token_591": 847, "token_592": 848, "token_593": 849, "token_594": 850, "token_595": 851, "token_596": 852, "token_597": 853, "token_598": 854, "token_599": 855, "token_600": 856, "token_601": 857, "token_602": 858, "token_603": 859, "token_604": 860, "token_605": 861, "token_606": 862, "token_607": 863, "token_608": 864, "token_609": 865, "token_610": 866, "token_611": 867, "token_612": 868, "token_613": 869, "token_614": 870, "token_615": 871, "token_616": 872, "token_617": 873, "token_618": 874, "token_619": 875, "token_620": 876, "token_621": 877, "token_622": 878, "token_623": 879, "token_624": 880, "token_625": 881, "token_626": 882, "token_627": 883, "token_628": 884, "token_629": 885, "token_630": 886, "token_631": 887, "token_632": 888, "token_633": 889, "token_634": 890, "token_635": 891, "token_636": 892, "token_637": 893, "token_638": 894, "token_639": 895, "token_640": 896, "token_641": 897, "token_642": 898, "token_643": 899, "token_644": 900, "token_645": 901, "token_646": 902, "token_647": 903, "token_648": 904, "token_649": 905, "token_650": 906, "token_651": 907, "token_652": 908, "token_653": 909, "token_654": 910, "token_655": 911, "token_656": 912, "token_657": 913, "token_658": 914, "token_659": 915, "token_660": 916, "token_661": 917, "token_662": 918, "token_663": 919, "token_664": 920, "token_665": 921, "token_666": 922, "token_667": 923, "token_668": 924, "token_669": 925, "token_670": 926, "token_671": 927, "token_672": 928, "token_673": 929, "token_674": 930, "token_675": 931, "token_676": 932, "token_677": 933, "token_678": 934, "token_679": 935, "token_680": 936, "token_681": 937, "token_682": 938, "token_683": 939, "token_684": 940, "token_685": 941, "token_686": 942, "token_687": 943, "token_688": 944, "token_689": 945, "token_690": 946, "token_691": 947, "token_692": 948, "token_693": 949, "token_694": 950, "token_695": 951, "token_696": 952, "token_697": 953, "token_698": 954, "token_699": 955, "token_700": 956, "token_701": 957, "token_702": 958, "token_703": 959, "token_704": 960, "token_705": 961, "token_706": 962, "token_707": 963, "token_708": 964, "token_709": 965, "token_710": 966, "token_711": 967, "token_712": 968, "token_713": 969, "token_714": 970, "token_715": 971, "token_716": 972, "token_717": 973, "token_718": 974, "token_719": 975, "token_720": 976, "token_721": 977, "token_722": 978, "token_723": 979, "token_724": 980, "token_725": 981, "token_726": 982, "token_727": 983, "token_728": 984, "token_729": 985, "token_730": 986, "token_731": 987, "token_732": 988, "token_733": 989, "token_734": 990, "token_735": 991, "token_736": 992, "token_737": 993, "token_738": 994, "token_739": 995, "token_740": 996, "token_741": 997, "token_742": 998, "token_743": 999}